/**
 * 医保
 */
export const enumMedicare = {
  A: '甲',
  B: '乙',
  C: '丙',
  ME_FEE: '自费',
}

/**
 * 用药途径
 */
export const enumUseWays = [
  '口服',
  '含服',
  '舌下含化',
  '外用',
  '外敷',
  '滴眼',
  '滴鼻',
  '口漱',
  '塞肛',
  '雾化吸入',
  '鼻饲',
  '静滴',
  '肌注',
  '静推',
]

/**
 * 用药频次
 */
export const enumUseFrequency = [
  '每日一次',
  '每日两次',
  '每日三次',
  '隔日一次',
  '每周一次',
  '每周两次',
  '每周三次',
  '隔周一次',
  '每两周一次',
  '每三周一次',
  '每四周一次',
  '30分钟一次',
  '每小时一次',
  '二小时一次',
  '三小时一次',
  '四小时一次',
  '六小时一次',
  '八小时一次',
  '12小时一次',
  '立即',
]

/**
 * 单位
 */
export const enumUnit = [
  'kg',
  '片',
  '小包',
  'g',
  '对',
  '板',
  '袋',
  '扎',
  '个',
  '丸',
  'mg',
  '包',
  '卷',
  'ml',
  '贴',
  '支',
  '瓶',
  '份',
  '盒',
  '枚',
  '条',
  '粒',
  'G',
]

export const enumTreatment = ['天', '月']
